src/InformationRegisters/ЖурналСобытийМЭДО/ЖурналСобытийМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналСобытийМЭДО</name>
  <resources>
    <name>АрхивЭСД</name>
    <comment>Внутри структура - ЛокальноеИмя и ДвоичныеДанные</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ИмяАрхиваЭСД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибкиКратко</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибкиПодробно</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>999</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Уровень</name>
    <type>
      <types>EnumRef.УровниСобытийМЭДО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектСОшибкойМЭДО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЖурналСобытийМЭДО/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьНаДиск(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Заголовок = НСтр("ru = 'Укажите каталог для сохранения файла'");
	Если Не Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли;

	
	ИмяФайла = ?(ЗначениеЗаполнено(Запись.ИмяАрхиваЭСД), Запись.ИмяАрхиваЭСД, НСтр("ru = 'имя-файла-по-умолчанию.zip'"));
	
	Файл = Новый Файл(Диалог.Каталог);
	Если Не Файл.Существует() Тогда
		ПоказатьПредупреждение( , 
			СтрШаблон(НСтр("ru = 'Каталог %1 не существует или не доступен!'"), Диалог.Каталог));
		Возврат;
	КонецЕсли;
	
	ПолноеИмяФайла = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(Диалог.Каталог) + ИмяФайла;
	Файл = Новый Файл(ПолноеИмяФайла);
	ДопПараметры = Новый Структура("ПолноеИмяФайла", ПолноеИмяФайла);
	Если Файл.Существует() Тогда
		Оповещение = Новый ОписаниеОповещения("ЗаписатьФайлЭсдНаДиск", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(Оповещение , НСтр("ru = 'Файл существует, перезаписать?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаписатьФайлЭсдНаДиск(КодВозвратаДиалога.Да, ДопПараметры);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Записать файл ЭСД на диск.
// 
// Параметры:
//  РезультатВопроса - КодВозвратаДиалога
//  ДопПараметры - Структура 
&НаКлиенте
Процедура ЗаписатьФайлЭсдНаДиск(РезультатВопроса, ДопПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ДвоичныеДанные = ПрочитатьДвоичныеДанныеФайлаЭсд();
	Если ТипЗнч(ДвоичныеДанные) <> Тип("ДвоичныеДанные") Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'В данной записи об ошибке не обнаружен файл.'"));
		Возврат;
	КонецЕсли;
	
	ДвоичныеДанные.Записать(ДопПараметры.ПолноеИмяФайла);
	
КонецПроцедуры

// Прочитать двоичные данные файла.
// 
// Возвращаемое значение:
//  Произвольный - Прочитать двоичные данные файла
&НаСервере
Функция ПрочитатьДвоичныеДанныеФайлаЭсд()
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Регистр.АрхивЭСД КАК АрхивЭСД
		|ИЗ
		|	РегистрСведений.ЖурналСобытийМЭДО КАК Регистр
		|ГДЕ
		|	Регистр.ДатаСобытия = &ДатаСобытия
		|	И Регистр.Объект = &Объект
		|	И Регистр.Идентификатор = &Идентификатор");
	Запрос.УстановитьПараметр("ДатаСобытия", Запись.ДатаСобытия);
	Запрос.УстановитьПараметр("Объект", Запись.Объект);
	Запрос.УстановитьПараметр("Идентификатор", Запись.Идентификатор);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.АрхивЭСД.Получить();
	КонецЕсли;
	
КонецФункции

#КонецОбласти
